## Plan Result (test-uksouth-test)




<pre><code>Plan: 88 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.public-dns.azurerm_dns_cname_record.this[&#34;_1b8b380f5b498882531eade6c02400cd&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;administer-orgs&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;adoption-web&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.administer-orgs&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.adoption-web&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.bar&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.benefit-appeal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.cft-api-mgmt&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.civil-citizen-ui&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.et-sya.perftest&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.fact&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.fact-admin&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.fees-register&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.fees-register-dom1&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.gateway-ccd&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.idam-user-dashboard&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.idam-web-admin&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.idam-web-public&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.immigration-appeal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.lau&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.manage-case&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.manage-org&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.moneyclaims&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.moneyclaims-legal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.paybubble&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.pcq&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.plum&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.privatelaw&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.probate&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.reformscan&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.register-org&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.return-case-doc-ccd&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.sscs-cor&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;bar&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;benefit-appeal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cft-api-mgmt&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;civil-citizen-ui&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;decree-absolute-aks&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;decree-nisi-aks&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;em8852.mail-prl-nonprod&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;et-sya&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;fact&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;fact-admin&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;fees-register&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;fees-register-dom1&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;gateway-ccd&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;idam-user-dashboard&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;idam-web-admin&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;idam-web-public&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;immigration-appeal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;lau&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;manage-case&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;manage-org&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;moneyclaims&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;moneyclaims-legal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;nfdiv&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;nfdiv-apply-for-divorce&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;nfdiv-end-civil-partnership&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;paybubble&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;paymentoutcome-web&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;pcq&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;petitioner-frontend-aks&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;plum&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;privatelaw&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;probate&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;reformscan&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;register-org&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;respond-divorce-aks&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;return-case-doc-ccd&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-prl-nonprod&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-prl-nonprod&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;sscs-cor&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;www.paymentoutcome-web&#34;]
  * module.public-dns.azurerm_dns_zone.zone
  * module.public-dns.azurerm_role_assignment.dnszonecontributer
  * module.test.azurerm_dns_cname_record.this[&#34;_7282fed294ef0ec9ee75406de0bb123d&#34;]
  * module.test.azurerm_dns_cname_record.this[&#34;afdverify.hmi-apim&#34;]
  * module.test.azurerm_dns_cname_record.this[&#34;afdverify.pip-frontend&#34;]
  * module.test.azurerm_dns_cname_record.this[&#34;afdverify.sds-api-mgmt&#34;]
  * module.test.azurerm_dns_cname_record.this[&#34;afdverify.toffee&#34;]
  * module.test.azurerm_dns_cname_record.this[&#34;afdverify.vh-wowza-public&#34;]
  * module.test.azurerm_dns_cname_record.this[&#34;hmi-apim&#34;]
  * module.test.azurerm_dns_cname_record.this[&#34;pip-frontend&#34;]
  * module.test.azurerm_dns_cname_record.this[&#34;sds-api-mgmt&#34;]
  * module.test.azurerm_dns_cname_record.this[&#34;toffee&#34;]
  * module.test.azurerm_dns_cname_record.this[&#34;vh-wowza-public&#34;]
  * module.test.azurerm_dns_zone.zone
  * module.test.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.public-dns.azurerm_dns_cname_record.this["_1b8b380f5b498882531eade6c02400cd"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_1b8b380f5b498882531eade6c02400cd"
      + record              = "F9A67113DE1A34EE3AB88C964719B045.D0CB73465718E425F308BE76B7946D22.b49fdab097253cac48e3.comodoca.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["administer-orgs"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "administer-orgs"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["adoption-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "adoption-web"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.administer-orgs"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.administer-orgs"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.adoption-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.adoption-web"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.bar"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.bar"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.benefit-appeal"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.benefit-appeal"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.cft-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.cft-api-mgmt"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.civil-citizen-ui"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.civil-citizen-ui"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.et-sya.perftest"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.et-sya.perftest"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.fact"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.fact"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.fact-admin"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.fact-admin"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.fees-register"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.fees-register"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.fees-register-dom1"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.fees-register-dom1"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.gateway-ccd"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.gateway-ccd"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.idam-user-dashboard"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.idam-user-dashboard"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.idam-web-admin"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.idam-web-admin"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.idam-web-public"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.idam-web-public"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.immigration-appeal"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.immigration-appeal"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.lau"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.lau"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.manage-case"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.manage-case"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.manage-org"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.manage-org"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.moneyclaims"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.moneyclaims"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.moneyclaims-legal"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.moneyclaims-legal"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.paybubble"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.paybubble"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.pcq"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.pcq"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.plum"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.plum"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.privatelaw"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.privatelaw"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.probate"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.probate"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.reformscan"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.reformscan"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.register-org"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.register-org"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.return-case-doc-ccd"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.return-case-doc-ccd"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.sscs-cor"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.sscs-cor"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["bar"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bar"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["benefit-appeal"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "benefit-appeal"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["cft-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cft-api-mgmt"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["civil-citizen-ui"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "civil-citizen-ui"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["decree-absolute-aks"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "decree-absolute-aks"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["decree-nisi-aks"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "decree-nisi-aks"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["em8852.mail-prl-nonprod"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "em8852.mail-prl-nonprod"
      + record              = "u24999805.wl056.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["et-sya"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "et-sya"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["fact"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "fact"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["fact-admin"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "fact-admin"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["fees-register"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "fees-register"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["fees-register-dom1"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "fees-register-dom1"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["gateway-ccd"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "gateway-ccd"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["idam-user-dashboard"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-user-dashboard"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["idam-web-admin"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-web-admin"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["idam-web-public"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-web-public"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["immigration-appeal"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "immigration-appeal"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["lau"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "lau"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["manage-case"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage-case"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["manage-org"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage-org"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["moneyclaims"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "moneyclaims"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["moneyclaims-legal"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "moneyclaims-legal"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["nfdiv"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "nfdiv"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["nfdiv-apply-for-divorce"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "nfdiv-apply-for-divorce"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["nfdiv-end-civil-partnership"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "nfdiv-end-civil-partnership"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["paybubble"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "paybubble"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["paymentoutcome-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "paymentoutcome-web"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["pcq"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pcq"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["petitioner-frontend-aks"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "petitioner-frontend-aks"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["plum"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "plum"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["privatelaw"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "privatelaw"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["probate"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "probate"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["reformscan"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformscan"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["register-org"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "register-org"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["respond-divorce-aks"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "respond-divorce-aks"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["return-case-doc-ccd"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "return-case-doc-ccd"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["s1._domainkey.mail-prl-nonprod"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "s1._domainkey.mail-prl-nonprod"
      + record              = "s1.domainkey.u24999805.wl056.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["s2._domainkey.mail-prl-nonprod"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "s2._domainkey.mail-prl-nonprod"
      + record              = "s2.domainkey.u24999805.wl056.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["sscs-cor"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sscs-cor"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["www.paymentoutcome-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www.paymentoutcome-web"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "perftest.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "perftest.platform.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.public-dns.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f0ab83b0-38df-4ae5-b203-fcef7ac01488"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.test.azurerm_dns_cname_record.this["_7282fed294ef0ec9ee75406de0bb123d"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_7282fed294ef0ec9ee75406de0bb123d"
      + record              = "291E4ECDF4D4809F9D80A200E4389C55.4EA964B71EF1DBCDC173D786B84B2A1F.5af7c96251ec5ea31663.comodoca.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test.azurerm_dns_cname_record.this["afdverify.hmi-apim"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.hmi-apim"
      + record              = "afdverify.hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test.azurerm_dns_cname_record.this["afdverify.pip-frontend"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.pip-frontend"
      + record              = "afdverify.hmcts-test.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test.azurerm_dns_cname_record.this["afdverify.sds-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.sds-api-mgmt"
      + record              = "afdverify.hmcts-test.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test.azurerm_dns_cname_record.this["afdverify.toffee"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.toffee"
      + record              = "afdverify.sdshmcts-test.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test.azurerm_dns_cname_record.this["afdverify.vh-wowza-public"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.vh-wowza-public"
      + record              = "afdverify.hmcts-test.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test.azurerm_dns_cname_record.this["hmi-apim"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hmi-apim"
      + record              = "hmcts-perftest.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test.azurerm_dns_cname_record.this["pip-frontend"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pip-frontend"
      + record              = "sdshmcts-test.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test.azurerm_dns_cname_record.this["sds-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-api-mgmt"
      + record              = "sdshmcts-test.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test.azurerm_dns_cname_record.this["toffee"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "toffee"
      + record              = "sdshmcts-test.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test.azurerm_dns_cname_record.this["vh-wowza-public"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-wowza-public"
      + record              = "sdshmcts-test.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "test.platform.hmcts.net"
    }

  # module.test.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "test.platform.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.test.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f0ab83b0-38df-4ae5-b203-fcef7ac01488"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 88 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":958,"Program":"tfcmt","SHA1":"","Target":"test-uksouth-test","Vars":{}} -->